time_to_answer/app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @admins = Admin.all.page(params[:page])