modulo3/lib/tasks/dev.rake

            ]

    coins.each do |coin|
      Coin.find_or_create_by!(coin)
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
              {description: "Proof of Work", acronym: "PoW"},
              {description:"Proof of Stake", acronym: "PoS"},
              {description: "Proof of Capacity", acronym:"PoC"}
            ]
    mining_types.each do |mining_type|
      MiningType.find_or_create_by!(mining_type)
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-07-04 13:27:58.518408"], ["updated_at", "2023-07-04 13:27:58.518408"]]